### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [2]:
# Dependencies and Setup
import pandas as pd

In [8]:
# File to Load (Remember to Change These)
purchase_data = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv(purchase_data)

purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

# Display the total number of players

In [65]:
count_players = purchase_data_df["SN"].nunique()
count_players

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [64]:
# Number of Unique Items
unique_items = purchase_data_df["Item ID"].nunique()
unique_items

179

In [63]:
#Averga price
average_price = purchase_data_df["Price"].mean()
average_price

3.050987179487176

In [66]:
# Total number of purchases
purchases_number = purchase_data_df["Purchase ID"].count()
purchases_number

780

In [68]:
# Total Revenue
total_revenue = purchase_data_df["Price"].sum()

total_revenue

2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [13]:
count_players = purchase_data_df["SN"].nunique()
count_players

576

In [9]:
Male_df = purchase_data_df.loc[purchase_data_df["Gender"] == "Male"]
Male_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [18]:
# Percentage Male Players
Male_players = Male_df["SN"].nunique()
percentage_male_p = Male_players/count_players*100
print(percentage_male_p)

84.02777777777779

In [20]:
Female_df = purchase_data_df.loc[purchase_data_df["Gender"] == "Female"]
Female_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79

In [24]:
# Percentage Female players
Female_players = Female_df["SN"].nunique()
percentage_female_p = Female_players/count_players*100
print(percentage_female_p)

14.0625

In [26]:
Other_df = purchase_data_df.loc[purchase_data_df["Gender"] == "Other / Non-Disclosed"]
Other_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39

In [28]:
# Percetage Other players
Other_players = Other_df["SN"].nunique()
percentage_other_p = Other_players/count_players*100
print(percentage_other_p)

1.9097222222222223


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [29]:
# Purchases count per Gender
count = purchase_data_df["Gender"].value_counts()
count

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [11]:
#Average Male price
Male_average_price = Male_df["Price"].mean()
Male_average_price

3.0178527607361953

In [108]:
# Average Female price
Female_average_price = Female_df["Price"].mean()
Female_average_price

3.203008849557519

In [111]:
# average other price
Other_average_price = Other_df["Price"].mean()
Other_average_price

3.3460000000000005

In [31]:
# Sum Male Pruchases
Male_purchases = Male_df["Price"].sum()
Male_purchases

1967.64

In [33]:
# Sum Female Pruchases
Female_purchases = Female_df["Price"].sum()
Female_purchases

361.94

In [34]:
# Sum Other Pruchases
Other_purchases = Other_df["Price"].sum()
Other_purchases

50.19

In [45]:
# Male average purchase per person
male_pruchases_per_person = Male_purchases/Male_players
male_pruchases_per_person

4.065371900826446

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [50]:
age_bin = [0, 9.9,14.9, 19.9,24.9,29.9,34.9,39.9,150]
age_labels = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [56]:
df_by_age = purchase_data_df.loc[:,["Gender","SN","Age","Price","Item ID"]]

In [57]:
df_by_age = df_by_age.drop_duplicates()

In [58]:
df_by_age["Age ranges"] = pd.cut(df_by_age["Age"],age_bin,labels=age_labels)

In [59]:
df_by_age

     Gender             SN  Age  Price  Item ID Age ranges
0      Male        Lisim78   20   3.53      108      20-24
1      Male    Lisovynya38   40   1.56      143        40+
2      Male     Ithergue48   24   4.88       92      20-24
3      Male  Chamassasya86   24   3.27      100      20-24
4      Male      Iskosia90   23   1.44      131      20-24
..      ...            ...  ...    ...      ...        ...
775  Female     Aethedru70   21   3.54       60      20-24
776    Male         Iral74   21   1.63      164      20-24
777    Male     Yathecal72   20   3.46       67      20-24
778    Male        Sisur91    7   4.19       92        <10
779    Male      Ennrian78   24   4.60       50      20-24

[780 rows x 6 columns]

In [60]:
age_totals = df_by_age["Age ranges"].value_counts()
age_totals

20-24    365
15-19    136
25-29    101
30-34     73
35-39     41
10-14     28
<10       23
40+       13
Name: Age ranges, dtype: int64

In [67]:
number_purchases_by_age = df_by_age.groupby("Age ranges").count()["Item ID"].rename("Purchases by age")
number_purchases_by_age

Age ranges
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Purchases by age, dtype: int64

In [63]:
total_purchases_by_age = df_by_age.groupby("Age ranges").sum()["Price"].rename("Total purchase price")
total_purchases_by_age

Age ranges
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Total purchase price, dtype: float64

In [64]:
average_pruchase_price = total_purchases_by_age/number_purchases_by_age
average_pruchase_price

Age ranges
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
dtype: float64

In [75]:
df_by_age.groupby("Age ranges").mean()["Price"].rename("Average purchase price")

Age ranges
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Average purchase price, dtype: float64

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80